
//==============================================================
//
//=============================================================
/*:
* @plugindesc 释放技能列表显示伤害预估值
* @author Lumnca
*
*
* 
*===================================================
* @help
*===================================================
* 
*  在技能释放界面可以显示技能能够造成的预估伤害，不计算敌方护甲造成的伤害减免。
*  只需要在技能说明写入计算式即可，如:
*   
*   对敌方全体造成 (mat*1.5 + 100) \i[78] 魔法伤害
*
*   必须在括号中写计算式，不能包含其他东西。计算式字符有以下
*
*   mat  : 魔法攻击
*   atk  : 物理攻击
*   
*   可以自行添加其他角色属性在下面代码中修改！
*
*    注意！只能有一个括号计算式，尽量避免不要在其中其他地方使用括号。
*
*
* ============================================================================
* Plugin Commands
* ============================================================================
*
* 无
*
*
*
* ============================================================================
* Changelog
* ============================================================================
*
* Version 1.0:
* 初始创建
* 
*/


(function(){
    //=======================================================================
    //解析字符串，并显示
    //=======================================================================
    const Window_Help_setItem  = Window_Help.prototype.setItem ;
    Window_Help.prototype.setItem = function(item) {
        if(item){
            if(item["actor"]){
                let str = /\((.+?)\)/i;
                let arr = item.description.match(str);
                if(arr){
                    let res = arr[1];
                    // 转义字符串，可增加其他属性值
                    res = res.replace('mat',"item.actor.mat")
                    res = res.replace('atk',"item.actor.atk")
                    item.description = item.description.replace(arr[0],eval(res))
                }
            }
        }
        Window_Help_setItem.call(this,item);
    };
    //=======================================================================
    // 技能的所有者
    //=======================================================================
    const  Window_SkillList_updateHelp =  Window_SkillList.prototype.updateHelp;
    Window_SkillList.prototype.updateHelp = function() {
        if(this.item()){
            this.item()["actor"] = this._actor;
        }
       
        Window_SkillList_updateHelp.call(this);
    };
})();